![imagen](./img/hr.png)

In [1]:
# https://www.sqltutorial.org/
# Ejemply pymsql + aws + pandas
import pymysql
import pandas as pd
ENDPOINT="hrdb.cn2cwau8envf.eu-north-1.rds.amazonaws.com"
PORT=3306
USER="admin"
REGION="eu-north-1b"
DBNAME="hrdb"
conn =  pymysql.connect(host=ENDPOINT, user=USER, passwd="BootcampDSPT24$", port=PORT)
# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = conn.cursor()

In [2]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [3]:
# Determinar que schema (colección de tablas) queremos usar
crsr.execute("USE HHRR_Jony;")

0

Cuenta el número de personas con distinto first_name por departamento

In [11]:
query = '''
SELECT e.department_id, department_name, COUNT(DISTINCT first_name) as NOMBRES_DISTINTOS
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
GROUP BY department_id
'''
sql_query(query)

    department_id   department_name  NOMBRES_DISTINTOS
0               1    Administration                  1
1               2         Marketing                  2
2               3        Purchasing                  6
3               4   Human Resources                  1
4               5          Shipping                  7
5               6                IT                  5
6               7  Public Relations                  1
7               8             Sales                  6
8               9         Executive                  3
9              10           Finance                  6
10             11        Accounting                  2

Cuenta el número de personas con igual first_name

In [20]:
query = '''
SELECT  COUNT(first_name) as NOMBRES, COUNT(DISTINCT first_name) as NOMBRES_DISTINTOS, COUNT(first_name)  - COUNT(DISTINCT first_name) as REPETIDOS
FROM employees AS e
'''
sql_query(query)

   NOMBRES  NOMBRES_DISTINTOS  REPETIDOS
0       40                 37          3

Selecciona la personas con salario entre 5.000 y 15.000 y con número de teléfono nulo

In [24]:
query = '''
SELECT  first_name, last_name
FROM employees
WHERE salary BETWEEN 5000 AND 15000
AND phone_number IS  NULL
'''
sql_query(query)

  first_name   last_name
0       John     Russell
1      Karen    Partners
2   Jonathon      Taylor
3       Jack  Livingston
4  Kimberely       Grant
5    Charles     Johnson

Usa CASE-WHEN-THEN-END para crear la columna "ANTES_96" que sea "SÍ" para contratados antes del año 1996 y "NO" para contratados desde el año 1996 en adelante.

In [26]:
query = '''
SELECT  first_name, last_name, hire_date,
CASE
    WHEN YEAR(hire_date) < 1996 THEN 'SI'
    WHEN YEAR(hire_date) >= 1996 THEN 'NO' 
END ANTES_96
FROM employees
'''
sql_query(query)

     first_name    last_name   hire_date ANTES_96
0        Steven         King  1987-06-17       SI
1         Neena      Kochhar  1989-09-21       SI
2           Lex      De Haan  1993-01-13       SI
3     Alexander       Hunold  1990-01-03       SI
4         Bruce        Ernst  1991-05-21       SI
5         David       Austin  1997-06-25       NO
6         Valli    Pataballa  1998-02-05       NO
7         Diana      Lorentz  1999-02-07       NO
8         Nancy    Greenberg  1994-08-17       SI
9        Daniel       Faviet  1994-08-16       SI
10         John         Chen  1997-09-28       NO
11       Ismael      Sciarra  1997-09-30       NO
12  Jose Manuel        Urman  1998-03-07       NO
13         Luis         Popp  1999-12-07       NO
14          Den     Raphaely  1994-12-07       SI
15    Alexander         Khoo  1995-05-18       SI
16       Shelli        Baida  1997-12-24       NO
17        Sigal       Tobias  1997-07-24       NO
18          Guy       Himuro  1998-11-15       NO
19        Karen   Colmenares  1999-08-10       NO
20      Matthew        Weiss  1996-07-18       NO
21         Adam        Fripp  1997-04-10       NO
22        Payam     Kaufling  1995-05-01       SI
23       Shanta      Vollman  1997-10-10       NO
24        Irene  Mikkilineni  1998-09-28       NO
25         John      Russell  1996-10-01       NO
26        Karen     Partners  1997-01-05       NO
27     Jonathon       Taylor  1998-03-24       NO
28         Jack   Livingston  1998-04-23       NO
29    Kimberely        Grant  1999-05-24       NO
30      Charles      Johnson  2000-01-04       NO
31        Sarah  Amorrabieta  1996-02-04       NO
32      Britney      Everett  1997-03-03       NO
33     Jennifer       Whalen  1987-09-17       SI
34      Michael    Hartstein  1996-02-17       NO
35          Pat          Fay  1997-08-17       NO
36        Susan       Mavris  1994-06-07       SI
37      Hermann         Baer  1994-06-07       SI
38      Shelley      Higgins  1994-06-07       SI
39      William        Gietz  1994-06-07       SI

Usa CASE-WHEN-THEN-ELSE-END para repetir el ejercicio anterior pero con ELSE para los contratados desd el año 1996 en adelante

In [28]:
query = '''
SELECT  first_name, last_name, hire_date,
CASE
    WHEN YEAR(hire_date) < 1996 THEN 'SI'
    ELSE 'NO' 
END ANTES_96
FROM employees
'''
sql_query(query)

     first_name    last_name   hire_date ANTES_96
0        Steven         King  1987-06-17       SI
1         Neena      Kochhar  1989-09-21       SI
2           Lex      De Haan  1993-01-13       SI
3     Alexander       Hunold  1990-01-03       SI
4         Bruce        Ernst  1991-05-21       SI
5         David       Austin  1997-06-25       NO
6         Valli    Pataballa  1998-02-05       NO
7         Diana      Lorentz  1999-02-07       NO
8         Nancy    Greenberg  1994-08-17       SI
9        Daniel       Faviet  1994-08-16       SI
10         John         Chen  1997-09-28       NO
11       Ismael      Sciarra  1997-09-30       NO
12  Jose Manuel        Urman  1998-03-07       NO
13         Luis         Popp  1999-12-07       NO
14          Den     Raphaely  1994-12-07       SI
15    Alexander         Khoo  1995-05-18       SI
16       Shelli        Baida  1997-12-24       NO
17        Sigal       Tobias  1997-07-24       NO
18          Guy       Himuro  1998-11-15       NO
19        Karen   Colmenares  1999-08-10       NO
20      Matthew        Weiss  1996-07-18       NO
21         Adam        Fripp  1997-04-10       NO
22        Payam     Kaufling  1995-05-01       SI
23       Shanta      Vollman  1997-10-10       NO
24        Irene  Mikkilineni  1998-09-28       NO
25         John      Russell  1996-10-01       NO
26        Karen     Partners  1997-01-05       NO
27     Jonathon       Taylor  1998-03-24       NO
28         Jack   Livingston  1998-04-23       NO
29    Kimberely        Grant  1999-05-24       NO
30      Charles      Johnson  2000-01-04       NO
31        Sarah  Amorrabieta  1996-02-04       NO
32      Britney      Everett  1997-03-03       NO
33     Jennifer       Whalen  1987-09-17       SI
34      Michael    Hartstein  1996-02-17       NO
35          Pat          Fay  1997-08-17       NO
36        Susan       Mavris  1994-06-07       SI
37      Hermann         Baer  1994-06-07       SI
38      Shelley      Higgins  1994-06-07       SI
39      William        Gietz  1994-06-07       SI

Cuenta el número de employees por cada manager (incluyendo el nombre en texto del manager, no solo el código ID) de mayor número de employees a menor

In [39]:
query = '''
SELECT  e2.first_name, e2.manager_id, COUNT(*) AS N_EMPLEADOS
FROM employees AS e1
INNER JOIN employees AS e2
ON e1.employee_id = e2.manager_id
GROUP BY e2.manager_id
ORDER BY N_EMPLEADOS DESC
'''
sql_query(query)

  first_name  manager_id  N_EMPLEADOS
0      Neena         100           14
1      Nancy         101            5
2     Daniel         108            5
3  Alexander         114            5
4      Bruce         103            4
5      Sarah         123            2
6  Alexander         102            1
7      Irene         120            1
8        Pat         201            1
9    William         205            1

In [38]:
query = '''
SELECT  *
FROM employees 
WHERE manager_id = 101 OR
employee_id = 101
'''
sql_query(query)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000.00,100,9
1,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.00,101,10
2,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.00,101,1
3,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.00,101,4
4,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.00,101,7
5,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.00,101,11

Selecciona la persona con menor salario cuyo manager es Neena
1. Busca el employee_id de Neena
2. Calcula el salario mínimo de aquellos que tienen el manager_id de Neena usando WHERE y el número de employee_id de Neena obtenido en la query anterior

In [40]:
query = '''
SELECT  employee_id, first_name
FROM employees 
WHERE first_name = "Neena"
'''
sql_query(query)

   employee_id first_name
0          101      Neena

In [41]:
query = '''
SELECT  MIN(salary)
FROM employees 
WHERE manager_id = 101
'''
sql_query(query)

  MIN(salary)
0     4400.00

In [44]:
query = '''
SELECT  first_name, salary
FROM employees 
WHERE manager_id = 101
'''
sql_query(query)

  first_name    salary
0      Nancy  12000.00
1   Jennifer   4400.00
2      Susan   6500.00
3    Hermann  10000.00
4    Shelley  12000.00

In [47]:
query = '''
SELECT  first_name, salary
FROM employees 
WHERE manager_id = 101
'''
sql_query(query)

  first_name    salary
0      Nancy  12000.00
1   Jennifer   4400.00
2      Susan   6500.00
3    Hermann  10000.00
4    Shelley  12000.00

In [50]:
query = '''
SELECT  first_name, salary
FROM employees 
WHERE manager_id = (
    SELECT  employee_id
    FROM employees 
    WHERE first_name = "Neena"
) 
AND salary = (SELECT  MIN(salary)
            FROM employees 
            WHERE manager_id = (    SELECT  employee_id
                                    FROM employees 
                                    WHERE first_name = "Neena")  )
'''
sql_query(query)

  first_name   salary
0   Jennifer  4400.00

In [63]:
query = '''
SELECT e.first_name, e.salary
FROM employees AS e
INNER JOIN (
    SELECT employee_id
    FROM employees
    WHERE first_name = 'Neena'
) AS tmp ON e.manager_id = tmp.employee_id
INNER JOIN (
    SELECT manager_id, MIN(salary) AS salary_min
    FROM employees
    GROUP BY manager_id
) AS tmp2 ON e.manager_id = tmp2.manager_id AND e.salary = tmp2.salary_min
'''
sql_query(query)

  first_name   salary
0   Jennifer  4400.00

Selecciona la persona con menor salario cuyo manager es Neena
1. Copia la query 2 del ejercicio anterior y sustituye el employee_id de Neena en la clausula where por la query que hiciste en el punto 1 del ejercicio anterior.

In [64]:
query = '''
SELECT  first_name, salary
FROM employees 
WHERE manager_id = (
    SELECT  employee_id
    FROM employees 
    WHERE first_name = "Neena"
) 
AND salary = (SELECT  MIN(salary)
            FROM employees 
            WHERE manager_id = (    SELECT  employee_id
                                    FROM employees 
                                    WHERE first_name = "Neena")  )
'''
sql_query(query)

  first_name   salary
0   Jennifer  4400.00

Cálcula los costes de salario por cada departamento con su nombre de departamento para aquellos departamentos que tengan unos costes de salario superiores a 10.000. Resuelvelo con HAVING y subqueries

In [72]:
query = ''' 
SELECT department_name, SUM(salary) AS costes_salario
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
GROUP BY e.department_id
HAVING costes_salario > 10000
'''
sql_query(query)

  department_name costes_salario
0       Marketing       19767.60
1      Purchasing       24900.00
2        Shipping       41200.00
3              IT       28800.00
4           Sales       57700.00
5       Executive       58000.00
6         Finance       51600.00
7      Accounting       20300.00

In [76]:
query = ''' 
SELECT * FROM (
SELECT department_name, SUM(salary) AS costes_salario
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
GROUP BY e.department_id) AS tmp
WHERE costes_salario > 10000
'''
sql_query(query)

  department_name costes_salario
0       Marketing       19767.60
1      Purchasing       24900.00
2        Shipping       41200.00
3              IT       28800.00
4           Sales       57700.00
5       Executive       58000.00
6         Finance       51600.00
7      Accounting       20300.00

In [79]:
query = ''' 
SELECT d.department_name,  costes_salario
FROM departments AS d
INNER JOIN (SELECT department_name, SUM(salary) AS costes_salario
            FROM employees AS e
            INNER JOIN departments AS d
            ON e.department_id = d.department_id
            GROUP BY e.department_id) AS tmp
ON d.department_name = tmp.department_name
WHERE tmp.costes_salario > 10000
'''
sql_query(query)

  department_name costes_salario
0       Marketing       19767.60
1      Purchasing       24900.00
2        Shipping       41200.00
3              IT       28800.00
4           Sales       57700.00
5       Executive       58000.00
6         Finance       51600.00
7      Accounting       20300.00

Cuenta el número de employees por cada departamento y puesto de trabajo (incluyendo el nombre en texto del departamento y puesto, no solo el código) para departamentos/empleos con más de 3 empleados. Resuelvelo con subqueries y HAVING

In [87]:
query = ''' 
SELECT department_name, job_title, COUNT(*) as N_TRABAJADORES
FROM employees AS e
INNER JOIN departments AS d
ON d.department_id = e.department_id
INNER JOIN jobs as j
ON j.job_id = e.job_id
GROUP BY d.department_id, e.job_id
HAVING N_TRABAJADORES>3
'''
sql_query(query)

  department_name             job_title  N_TRABAJADORES
0      Purchasing      Purchasing Clerk               5
1        Shipping         Stock Manager               4
2              IT            Programmer               5
3           Sales  Sales Representative               4
4         Finance            Accountant               5

In [88]:
query = ''' 
SELECT *
FROM (
    SELECT department_name, job_title, COUNT(*) as N_TRABAJADORES
    FROM employees AS e
    INNER JOIN departments AS d
    ON d.department_id = e.department_id
    INNER JOIN jobs as j
    ON j.job_id = e.job_id
    GROUP BY d.department_id, e.job_id) AS tmp 
WHERE tmp.N_TRABAJADORES > 3
'''
sql_query(query)

  department_name             job_title  N_TRABAJADORES
0      Purchasing      Purchasing Clerk               5
1        Shipping         Stock Manager               4
2              IT            Programmer               5
3           Sales  Sales Representative               4
4         Finance            Accountant               5

Calcula el número de employees para los departamentos que empiezan por la letra A. 
Resuelvelo con JOIN y con SUBQUERIES

In [95]:
# NATURAL
query = ''' 
SELECT department_name, COUNT(*) AS N_EMPLEADOS 
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id 
WHERE department_name like "A%"
GROUP BY d.department_id 
'''
sql_query(query)

  department_name  N_EMPLEADOS
0  Administration            1
1      Accounting            2

In [96]:
# MENOS NATURAL
query = ''' 
SELECT department_name, COUNT(*) AS N_EMPLEADOS 
FROM employees AS e
INNER JOIN (
            SELECT * FROM departments 
            WHERE department_name LIKE "A%")   
            AS d
ON e.department_id = d.department_id 
GROUP BY d.department_id 
'''
sql_query(query)

  department_name  N_EMPLEADOS
0  Administration            1
1      Accounting            2

Calcula el salario máximo, mínimo y medio por cada departamento

In [97]:
query = ''' 
SELECT department_name, MIN(salary) AS salario_min, MAX(salary) AS salario_max, AVG(salary) as salario_avg
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id  
GROUP BY e.department_id 
'''
sql_query(query)

     department_name salario_min salario_max   salario_avg
0     Administration     4400.00     4400.00   4400.000000
1          Marketing     6242.40    13525.20   9883.800000
2         Purchasing     2500.00    11000.00   4150.000000
3    Human Resources     6500.00     6500.00   6500.000000
4           Shipping     2700.00     8200.00   5885.714286
5                 IT     4200.00     9000.00   5760.000000
6   Public Relations    10000.00    10000.00  10000.000000
7              Sales     6200.00    14000.00   9616.666667
8          Executive    17000.00    24000.00  19333.333333
9            Finance     6900.00    12000.00   8600.000000
10        Accounting     8300.00    12000.00  10150.000000

Calcula la persona con salario mínimo por departamento
Debes mostrar el nombre y apellido de la persona, el nombre del departamento y su salario

In [103]:
query = ''' 
SELECT first_name, last_name, department_name, salary 
FROM employees AS e
INNER JOIN (
    SELECT department_name, e.department_id, MIN(salary) AS salario_min
    FROM employees AS e
    INNER JOIN departments AS d
    ON e.department_id = d.department_id  
    GROUP BY e.department_id) AS tmp
ON  tmp.salario_min = e.salary AND tmp.department_id = e.department_id
ORDER BY salary
'''
sql_query(query)

   first_name    last_name   department_name    salary
0       Karen   Colmenares        Purchasing   2500.00
1       Irene  Mikkilineni          Shipping   2700.00
2       Diana      Lorentz                IT   4200.00
3    Jennifer       Whalen    Administration   4400.00
4     Charles      Johnson             Sales   6200.00
5         Pat          Fay         Marketing   6242.40
6       Susan       Mavris   Human Resources   6500.00
7        Luis         Popp           Finance   6900.00
8     William        Gietz        Accounting   8300.00
9     Hermann         Baer  Public Relations  10000.00
10      Neena      Kochhar         Executive  17000.00
11        Lex      De Haan         Executive  17000.00

In [113]:
query = ''' 
SELECT first_name, last_name, e.department_id,tmp.department_id, department_name, salary 
FROM employees AS e
INNER JOIN (
    SELECT department_name, e.department_id, MIN(salary) AS salario_min
    FROM employees AS e
    INNER JOIN departments AS d
    ON e.department_id = d.department_id  
    GROUP BY e.department_id) AS tmp
ON  tmp.salario_min = e.salary 
ORDER BY salary
'''
sql_query(query)

,first_name,last_name,department_id,department_id,department_name,salary
0,Karen,Colmenares,3,3,Purchasing,2500.00
1,Irene,Mikkilineni,5,5,Shipping,2700.00
2,Diana,Lorentz,6,6,IT,4200.00
3,Jennifer,Whalen,1,1,Administration,4400.00
4,Charles,Johnson,8,8,Sales,6200.00
5,Pat,Fay,2,2,Marketing,6242.40
6,Shanta,Vollman,5,4,Human Resources,6500.00
7,Susan,Mavris,4,4,Human Resources,6500.00
8,Luis,Popp,10,10,Finance,6900.00
9,William,Gietz,11,11,Accounting,8300.00
10,Hermann,Baer,7,7,Public Relations,10000.00
11,Lex,De Haan,9,9,Executive,17000.00
12,Neena,Kochhar,9,9,Executive,17000.00

In [110]:
query = ''' 
SELECT first_name, last_name, e.department_id, department_name, salary 
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
WHERE first_name = "SUSAN"
'''
sql_query(query)

  first_name last_name  department_id  department_name   salary
0      Susan    Mavris              4  Human Resources  6500.00

In [111]:
query = ''' 
SELECT first_name, last_name, e.department_id, department_name, salary 
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
WHERE first_name = "Shanta"
'''
sql_query(query)

  first_name last_name  department_id department_name   salary
0     Shanta   Vollman              5        Shipping  6500.00

In [112]:
query = ''' 
SELECT department_name, MIN(salary) AS salario_min, MAX(salary) AS salario_max, AVG(salary) as salario_avg
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id  
GROUP BY e.department_id 
'''
sql_query(query)

     department_name salario_min salario_max   salario_avg
0     Administration     4400.00     4400.00   4400.000000
1          Marketing     6242.40    13525.20   9883.800000
2         Purchasing     2500.00    11000.00   4150.000000
3    Human Resources     6500.00     6500.00   6500.000000
4           Shipping     2700.00     8200.00   5885.714286
5                 IT     4200.00     9000.00   5760.000000
6   Public Relations    10000.00    10000.00  10000.000000
7              Sales     6200.00    14000.00   9616.666667
8          Executive    17000.00    24000.00  19333.333333
9            Finance     6900.00    12000.00   8600.000000
10        Accounting     8300.00    12000.00  10150.000000

Cuenta el número de employees por cada departamento (incluyendo el nombre en texto del departamento, no solo el código) con 2, 4, 6 empleoyeess (probar WHERE y HAVING)

In [118]:
query = '''  
SELECT department_name, COUNT(*) as N_EMPLEADOS
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
GROUP BY d.department_id
HAVING N_EMPLEADOS IN (2,4,6)
'''
sql_query(query)

  department_name  N_EMPLEADOS
0       Marketing            2
1      Purchasing            6
2           Sales            6
3         Finance            6
4      Accounting            2

In [121]:
query = '''
SELECT *  FROM (
    SELECT department_name, COUNT(*) as N_EMPLEADOS
    FROM employees AS e
    INNER JOIN departments AS d
    ON e.department_id = d.department_id
    GROUP BY d.department_id) AS tmp
WHERE  N_EMPLEADOS IN (2,4,6)
'''
sql_query(query)

  department_name  N_EMPLEADOS
0       Marketing            2
1      Purchasing            6
2           Sales            6
3         Finance            6
4      Accounting            2

Muestra el nombre y apellido de las personas que son el único empleado para ese departamento y tipo de trabajo

In [127]:
query = '''  
SELECT first_name, last_name, department_name, job_title, COUNT(*) as N_EMPLEADOS
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
INNER JOIN jobs AS j
ON j.job_id = e.job_id
GROUP BY d.department_id, e.job_id
'''
sql_query(query)

,first_name,last_name,department_name,job_title,N_EMPLEADOS
0,Jennifer,Whalen,Administration,Administration Assistant,1
1,Michael,Hartstein,Marketing,Marketing Manager,1
2,Pat,Fay,Marketing,Marketing Representative,1
3,Den,Raphaely,Purchasing,Purchasing Manager,1
4,Alexander,Khoo,Purchasing,Purchasing Clerk,5
5,Susan,Mavris,Human Resources,Human Resources Representative,1
6,Matthew,Weiss,Shipping,Stock Manager,4
7,Irene,Mikkilineni,Shipping,Stock Clerk,1
8,Sarah,Amorrabieta,Shipping,Shipping Clerk,2
9,Alexander,Hunold,IT,Programmer,5
10,Hermann,Baer,Public Relations,Public Relations Representative,1
11,John,Russell,Sales,Sales Manager,2
12,Jonathon,Taylor,Sales,Sales Representative,4
13,Steven,King,Executive,President,1
14,Neena,Kochhar,Executive,Administration Vice President,2
15,Nancy,Greenberg,Finance,Finance Manager,1
16,Daniel,Faviet,Finance,Accountant,5
17,Shelley,Higgins,Accounting,Accounting Manager,1
18,William,Gietz,Accounting,Public Accountant,1

In [128]:
query = '''  
SELECT first_name, last_name, department_name, job_title, COUNT(*) as N_EMPLEADOS
FROM employees AS e
INNER JOIN departments AS d
ON e.department_id = d.department_id
INNER JOIN jobs AS j
ON j.job_id = e.job_id
GROUP BY d.department_id, e.job_id
HAVING N_EMPLEADOS = 1
'''
sql_query(query)

,first_name,last_name,department_name,job_title,N_EMPLEADOS
0,Jennifer,Whalen,Administration,Administration Assistant,1
1,Michael,Hartstein,Marketing,Marketing Manager,1
2,Pat,Fay,Marketing,Marketing Representative,1
3,Den,Raphaely,Purchasing,Purchasing Manager,1
4,Susan,Mavris,Human Resources,Human Resources Representative,1
5,Irene,Mikkilineni,Shipping,Stock Clerk,1
6,Hermann,Baer,Public Relations,Public Relations Representative,1
7,Steven,King,Executive,President,1
8,Nancy,Greenberg,Finance,Finance Manager,1
9,Shelley,Higgins,Accounting,Accounting Manager,1
10,William,Gietz,Accounting,Public Accountant,1

In [132]:
query = '''  
SELECT first_name, last_name, department_name, job_title, N_EMPLEADOS
FROM employees AS e
INNER JOIN (
    SELECT e.job_id, department_name, job_title, COUNT(*) as N_EMPLEADOS
    FROM employees AS e
    INNER JOIN departments AS d
    ON e.department_id = d.department_id
    INNER JOIN jobs AS j
    ON j.job_id = e.job_id
    GROUP BY d.department_id, e.job_id) AS tmp
ON e.job_id = tmp.job_id 
WHERE N_EMPLEADOS = 1
'''
sql_query(query)

,first_name,last_name,department_name,job_title,N_EMPLEADOS
0,Jennifer,Whalen,Administration,Administration Assistant,1
1,Michael,Hartstein,Marketing,Marketing Manager,1
2,Pat,Fay,Marketing,Marketing Representative,1
3,Den,Raphaely,Purchasing,Purchasing Manager,1
4,Susan,Mavris,Human Resources,Human Resources Representative,1
5,Irene,Mikkilineni,Shipping,Stock Clerk,1
6,Hermann,Baer,Public Relations,Public Relations Representative,1
7,Steven,King,Executive,President,1
8,Nancy,Greenberg,Finance,Finance Manager,1
9,Shelley,Higgins,Accounting,Accounting Manager,1
10,William,Gietz,Accounting,Public Accountant,1

In [137]:
query = '''  
SELECT first_name, employee_id, manager_id FROM
employees 
WHERE first_name LIKE "_e%"
'''
sql_query(query)

  first_name  employee_id  manager_id
0      Neena          101         100
1        Lex          102         100
2        Den          114         100
3   Jennifer          200         101
4    Hermann          204         101

In [141]:
query = ''' 
SELECT * FROM
employees 
WHERE manager_id IN (101,102,114,200,204)
'''
sql_query(query)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.00,101,10
1,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.00,101,1
2,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.00,101,4
3,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.00,101,7
4,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.00,101,11
5,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102,6
6,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100.00,114,3
7,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900.00,114,3
8,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800.00,114,3
9,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600.00,114,3
10,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500.00,114,3

In [143]:
query = ''' 
SELECT * FROM
employees 
WHERE manager_id IN (
    SELECT employee_id FROM
    employees 
    WHERE first_name LIKE "_e%")
'''
sql_query(query)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.00,101,10
1,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.00,101,1
2,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.00,101,4
3,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.00,101,7
4,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.00,101,11
5,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102,6
6,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100.00,114,3
7,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900.00,114,3
8,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800.00,114,3
9,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600.00,114,3
10,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500.00,114,3

In [148]:
query = ''' 
SELECT e.*, tmp.first_name as manager_name FROM
employees AS e 
INNER JOIN (SELECT first_name, employee_id, manager_id FROM
employees 
WHERE first_name LIKE "_e%") AS tmp
ON e.manager_id = tmp.employee_id
'''
sql_query(query)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id,manager_name
0,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.00,101,10,Neena
1,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.00,101,1,Neena
2,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.00,101,4,Neena
3,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.00,101,7,Neena
4,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.00,101,11,Neena
5,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102,6,Lex
6,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100.00,114,3,Den
7,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900.00,114,3,Den
8,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800.00,114,3,Den
9,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600.00,114,3,Den
10,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500.00,114,3,Den

In [154]:
query = ''' 
SELECT e1.*, e2.first_name as manager_name FROM
employees AS e1 
INNER JOIN
employees e2
ON e2.employee_id = e1.manager_id
WHERE e2.first_name LIKE "_e%"
'''
sql_query(query)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id,manager_name
0,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000.00,101,10,Neena
1,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400.00,101,1,Neena
2,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500.00,101,4,Neena
3,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000.00,101,7,Neena
4,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000.00,101,11,Neena
5,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102,6,Lex
6,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100.00,114,3,Den
7,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900.00,114,3,Den
8,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800.00,114,3,Den
9,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600.00,114,3,Den
10,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500.00,114,3,Den

Actualiza el apellido de employee_id 190 a "López"

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Incrementa el salario en un 2% de todos los empleados cuyo manager es Neena

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Crea la tabla 

CREATE TABLE courses_XX (
    course_id INT AUTO_INCREMENT PRIMARY KEY,
    course_name VARCHAR(256) NOT NULL
);
EN XX pon tu nombre

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Añade a la tabla courses:

INSERT INTO courses(course_name) VALUES ('Python');

INSERT INTO courses(course_name) VALUES ('SQL');

INSERT INTO courses(course_name) VALUES ('Introducción a la Fenomenología del Espíritu de Hegel para no hegelianos');

Selecciona la tabla courses tras los INSERT

In [ ]:
#No olvides el commit al final!
#crsr.execute("COMMIT;")

Prueba: INSERT INTO courses(course_id, course_name) VALUES (3, 'Hegel');

Pide al usuario que introduzca un nombre de empleado con input y muestra su Nombre, apellido, nombre de departamento, job title y salario